app/views/decisions/_show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."decision_id" = $1 AND "answers"."answer" = $2  [["decision_id", 4], ["answer", "Explain"]]
---
          <div class="col-xs-2"></div>
          <% Answer.types.each do |type| %><div class="col-xs-2"><%= Answer.find_all_names(type, decision.answers, @user) %></div><% end %>