app/views/contracts/show.html.erb

  <% if @contract.decisions %>
      <%= render 'decisions/show', :@decisions => @contract.decisions.order('id'), :@user => current_user, :@owner => @owner, :@viewer => @viewer %>
---
SELECT "decisions".* FROM "decisions" WHERE "decisions"."contract_id" = $1  [["contract_id", 1]]