app/controllers/answers_controller.rb

SELECT  "decisions".* FROM "decisions" WHERE "decisions"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def new
    @decision = Decision.find(params[:decision_id])

SELECT  "answers".* FROM "answers" WHERE "answers"."name" = $1 AND "answers"."decision_id" = $2 ORDER BY "answers"."id" ASC LIMIT $3  [["name", "Sean N."], ["decision_id", 2], ["LIMIT", 1]]
UPDATE "answers" SET "answer" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["answer", "Consult"], ["updated_at", 2016-11-17 22:06:31 UTC], ["id", 1]]
INSERT INTO "answers" ("name", "answer", "created_at", "updated_at", "decision_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Sean Norton"], ["answer", "Consult"], ["created_at", 2016-11-01 20:46:42 UTC], ["updated_at", 2016-11-01 20:46:42 UTC], ["decision_id", 4]]
---
  def create
    @answer = Answer.where(name: answer_params[:name], decision_id: answer_params[:decision_id]).first rescue nil
    if @answer.blank?
      @answer = Answer.new(answer_params)
    else
      @answer.update(answer_params)
    end

    if @answer.save