app/controllers/contracts_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2016-11-10 21:47:29 UTC], ["updated_at", 2016-11-10 21:47:29 UTC]]
INSERT INTO "contracts" ("title", "link", "created_at", "updated_at", "owner_link", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "DO I HAVE A USER"], ["link", "r8dfPiE"], ["created_at", 2016-11-10 21:48:44 UTC], ["updated_at", 2016-11-10 21:48:44 UTC], ["owner_link", "iNkeqNA"], ["user_id", 2]]
---
  def create
    @contract = Contract.new(contract_params)
    @contract = make_links(@contract)

    if session[:user_id]
      @contract.user_id = session[:user_id]
    else
      @user = User.create
      @contract.user_id = @user.id
      session[:user_id] = @user.id
    end

    if @contract.save

SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = $1 AND "contracts"."owner_link" = $2 LIMIT $3  [["id", 2], ["owner_link", "9BjmAVA"], ["LIMIT", 1]]
---
  def show
    @contract = Contract.find_by(id: params[:id], link: params[:link]) || Contract.find_by(id: params[:id], owner_link: params[:link])