app/controllers/decisions_controller.rb

  def create
    @decision = Decision.new(decision_params)
    if @decision.save
      @contract = Contract.find(@decision.contract_id)
---
INSERT INTO "decisions" ("description", "contract_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "To Plural or not to Plural"], ["contract_id", 3], ["created_at", 2016-11-01 20:28:30 UTC], ["updated_at", 2016-11-01 20:28:30 UTC]]
SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]